*** crates/acrylius-core/src/core.rs:1243:9: replace Core::best_link -> Option<(LinkId, &UpLink)> with None

*** mutation diff:
--- crates/acrylius-core/src/core.rs
+++ replace Core::best_link -> Option<(LinkId, &UpLink)> with None
@@ -1235,23 +1235,17 @@
     /// names, and whether a file can be carried at all. Those were three
     /// separate walks that agreed only because a `BTreeMap` happens to order
     /// `LinkId`s the way transports are numbered — true by convention in the
     /// daemon, and quietly false anywhere ids are minted another way.
     ///
     /// Preference is ascending transport id: Wi-Fi before Bluetooth, which is
     /// the order the hosts register them in.
     fn best_link(&self, peer: &DeviceId) -> Option<(LinkId, &UpLink)> {
-        self.links
-            .iter()
-            .filter_map(|(id, st)| match st {
-                LinkState::Up(u) if &u.peer == peer => Some((*id, &**u)),
-                _ => None,
-            })
-            .min_by_key(|(_, u)| u.transport)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     fn best_link_transport(&self, peer: &DeviceId) -> Option<TransportId> {
         self.best_link(peer).map(|(_, u)| u.transport)
     }
 
     #[must_use]
     pub fn transport_for(&self, peer: &DeviceId) -> Option<TransportKind> {

---- a_better_transport_is_taken_even_while_a_worse_one_is_working stdout ----

thread 'a_better_transport_is_taken_even_while_a_worse_one_is_working' (286649) panicked at crates/acrylius-core/tests/loopback.rs:590:5:
assertion `left == right` failed: being reachable already is no reason to stay on the worse transport
  left: []
 right: [(TransportId(0), "B")]

---- a_file_is_offered_accepted_and_finished stdout ----

thread 'a_file_is_offered_accepted_and_finished' (286654) panicked at crates/acrylius-core/tests/loopback.rs:1258:5:
the receiving host is asked before anything is listened for

---- a_body_too_large_for_the_link_is_refused_not_sent stdout ----

thread 'a_body_too_large_for_the_link_is_refused_not_sent' (286650) panicked at crates/acrylius-core/tests/loopback.rs:1483:5:
the sender is told it does not fit

failures:
    a_better_transport_is_taken_even_while_a_worse_one_is_working
    a_body_too_large_for_the_link_is_refused_not_sent
    a_device_with_nowhere_to_put_a_file_refuses_at_once
    a_file_is_offered_accepted_and_finished
    a_file_sends_again_once_wi_fi_takes_over_from_bluetooth
    a_hello_no_newer_than_the_last_one_is_refused
    a_link_that_can_carry_files_is_left_alone
    a_link_that_cannot_carry_files_refuses_instead_of_listening
    a_message_goes_to_the_peer_it_is_addressed_to
    a_paired_peer_can_open_a_session_and_ping
    a_worse_transport_takes_over_when_the_better_one_dies
    rejecting_an_offer_tells_the_sender_and_opens_nothing

test result: FAILED. 19 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
