*** crates/acrylius-core/src/core.rs:1246:37: replace match guard &u.peer == peer with false in Core::best_link

*** mutation diff:
--- crates/acrylius-core/src/core.rs
+++ replace match guard &u.peer == peer with false in Core::best_link
@@ -1238,17 +1238,17 @@
     /// daemon, and quietly false anywhere ids are minted another way.
     ///
     /// Preference is ascending transport id: Wi-Fi before Bluetooth, which is
     /// the order the hosts register them in.
     fn best_link(&self, peer: &DeviceId) -> Option<(LinkId, &UpLink)> {
         self.links
             .iter()
             .filter_map(|(id, st)| match st {
-                LinkState::Up(u) if &u.peer == peer => Some((*id, &**u)),
+                LinkState::Up(u) if false /* ~ changed by cargo-mutants ~ */ => Some((*id, &**u)),
                 _ => None,
             })
             .min_by_key(|(_, u)| u.transport)
     }
 
     fn best_link_transport(&self, peer: &DeviceId) -> Option<TransportId> {
         self.best_link(peer).map(|(_, u)| u.transport)
     }

---- a_file_is_offered_accepted_and_finished stdout ----

thread 'a_file_is_offered_accepted_and_finished' (287776) panicked at crates/acrylius-core/tests/loopback.rs:1258:5:
the receiving host is asked before anything is listened for

---- a_better_transport_is_taken_even_while_a_worse_one_is_working stdout ----

thread 'a_better_transport_is_taken_even_while_a_worse_one_is_working' (287771) panicked at crates/acrylius-core/tests/loopback.rs:590:5:
assertion `left == right` failed: being reachable already is no reason to stay on the worse transport
  left: []
 right: [(TransportId(0), "B")]

---- a_file_sends_again_once_wi_fi_takes_over_from_bluetooth stdout ----

thread 'a_file_sends_again_once_wi_fi_takes_over_from_bluetooth' (287777) panicked at crates/acrylius-core/tests/loopback.rs:1406:5:
over Bluetooth alone a file is refused, and the sender is told

failures:
    a_better_transport_is_taken_even_while_a_worse_one_is_working
    a_body_too_large_for_the_link_is_refused_not_sent
    a_device_with_nowhere_to_put_a_file_refuses_at_once
    a_file_is_offered_accepted_and_finished
    a_file_sends_again_once_wi_fi_takes_over_from_bluetooth
    a_hello_no_newer_than_the_last_one_is_refused
    a_link_that_can_carry_files_is_left_alone
    a_link_that_cannot_carry_files_refuses_instead_of_listening
    a_message_goes_to_the_peer_it_is_addressed_to
    a_paired_peer_can_open_a_session_and_ping
    a_worse_transport_takes_over_when_the_better_one_dies
    rejecting_an_offer_tells_the_sender_and_opens_nothing

test result: FAILED. 19 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
