*** crates/acrylius-core/src/core.rs:1253:9: replace Core::best_link_transport -> Option<TransportId> with None

*** mutation diff:
--- crates/acrylius-core/src/core.rs
+++ replace Core::best_link_transport -> Option<TransportId> with None
@@ -1245,17 +1245,17 @@
             .filter_map(|(id, st)| match st {
                 LinkState::Up(u) if &u.peer == peer => Some((*id, &**u)),
                 _ => None,
             })
             .min_by_key(|(_, u)| u.transport)
     }
 
     fn best_link_transport(&self, peer: &DeviceId) -> Option<TransportId> {
-        self.best_link(peer).map(|(_, u)| u.transport)
+        None /* ~ changed by cargo-mutants ~ */
     }
 
     #[must_use]
     pub fn transport_for(&self, peer: &DeviceId) -> Option<TransportKind> {
         self.best_link(peer).map(|(_, u)| u.kind.clone())
     }
 
     fn dispatch_bulk(&mut self, request: BulkRequest, out: &mut Outcome) {

---- a_better_transport_is_taken_even_while_a_worse_one_is_working stdout ----

thread 'a_better_transport_is_taken_even_while_a_worse_one_is_working' (288897) panicked at crates/acrylius-core/tests/loopback.rs:590:5:
assertion `left == right` failed: being reachable already is no reason to stay on the worse transport
  left: []
 right: [(TransportId(0), "B")]

---- a_file_sends_again_once_wi_fi_takes_over_from_bluetooth stdout ----

thread 'a_file_sends_again_once_wi_fi_takes_over_from_bluetooth' (288903) panicked at crates/acrylius-core/tests/loopback.rs:1420:5:
assertion `left == right` failed: the better transport is dialled even though a link already exists
  left: []
 right: [(TransportId(0), "B")]

---- a_worse_transport_takes_over_when_the_better_one_dies stdout ----

thread 'a_worse_transport_takes_over_when_the_better_one_dies' (288914) panicked at crates/acrylius-core/tests/loopback.rs:503:5:
assertion `left == right` failed: the better transport carries while both are up
  left: Some(BleGatt)
 right: Some(UnixLoopback)

failures:
    a_better_transport_is_taken_even_while_a_worse_one_is_working
    a_file_sends_again_once_wi_fi_takes_over_from_bluetooth
    a_worse_transport_takes_over_when_the_better_one_dies

test result: FAILED. 28 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
