*** crates/acrylius-core/src/core.rs:216:46: replace match guard h.expect.as_ref() == Some(peer) with false in Core::peer_state

*** mutation diff:
--- crates/acrylius-core/src/core.rs
+++ replace match guard h.expect.as_ref() == Some(peer) with false in Core::peer_state
@@ -208,17 +208,17 @@
             .map(|a| a.sas.as_str())
     }
 
     #[must_use]
     pub fn peer_state(&self, peer: &DeviceId) -> PeerState {
         for st in self.links.values() {
             match st {
                 LinkState::Up(u) if &u.peer == peer => return PeerState::Reachable,
-                LinkState::Handshaking(h) if h.expect.as_ref() == Some(peer) => {
+                LinkState::Handshaking(h) if false /* ~ changed by cargo-mutants ~ */ => {
                     return PeerState::Connecting;
                 }
                 _ => {}
             }
         }
         PeerState::Unreachable
     }

*** result: Success
