*** crates/acrylius-core/src/core.rs:661:9: replace Core::accept_hello -> bool with true

*** mutation diff:
--- crates/acrylius-core/src/core.rs
+++ replace Core::accept_hello -> bool with true
@@ -653,49 +653,17 @@
                 return;
             }
             self.finish_session(now_ms, link, h.hs, h.attrs, peer, out);
         }
     }
 
     /// Validate a peer's Hello and advance its replay watermark.
     fn accept_hello(&mut self, peer: &DeviceId, payload: &[u8], out: &mut Outcome) -> bool {
-        let Ok(hello) = minicbor::decode::<Hello>(payload) else {
-            out.ui(UiEvent::Error {
-                code: ErrorCode::BadBody,
-                detail: "handshake payload did not decode".to_string(),
-            });
-            return false;
-        };
-        let Some(rec) = self.peers.get_mut(peer) else {
-            return false;
-        };
-        match hello.check_freshness(self.wall_ms, GreatestSeen(rec.greatest_seen)) {
-            Ok(seen) => {
-                rec.greatest_seen = seen.0;
-                rec.name = hello.name;
-                rec.platform = hello.platform;
-                rec.caps_out = hello.caps_out;
-                rec.caps_in = hello.caps_in;
-                let (key, value) = Self::peer_blob(rec);
-                out.push(Action::Persist {
-                    key,
-                    value,
-                    sensitivity: Sensitivity::Secret,
-                });
-                true
-            }
-            Err(e) => {
-                out.ui(UiEvent::Error {
-                    code: ErrorCode::NotAllowed,
-                    detail: e.to_string(),
-                });
-                false
-            }
-        }
+        true /* ~ changed by cargo-mutants ~ */
     }
 
     fn finish_session(
         &mut self,
         now_ms: u64,
         link: LinkId,
         hs: Handshake,
         attrs: LinkAttrs,

---- a_hello_no_newer_than_the_last_one_is_refused stdout ----

thread 'a_hello_no_newer_than_the_last_one_is_refused' (260943) panicked at crates/acrylius-core/tests/loopback.rs:564:5:
assertion `left == right` failed: a replayed opener must not open a session, however good its route
  left: Some(UnixLoopback)
 right: Some(BleGatt)

failures:
    a_hello_no_newer_than_the_last_one_is_refused

test result: FAILED. 29 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
