*** crates/acrylius-core/src/core.rs:661:9: replace Core::accept_hello -> bool with false

*** mutation diff:
--- crates/acrylius-core/src/core.rs
+++ replace Core::accept_hello -> bool with false
@@ -653,49 +653,17 @@
                 return;
             }
             self.finish_session(now_ms, link, h.hs, h.attrs, peer, out);
         }
     }
 
     /// Validate a peer's Hello and advance its replay watermark.
     fn accept_hello(&mut self, peer: &DeviceId, payload: &[u8], out: &mut Outcome) -> bool {
-        let Ok(hello) = minicbor::decode::<Hello>(payload) else {
-            out.ui(UiEvent::Error {
-                code: ErrorCode::BadBody,
-                detail: "handshake payload did not decode".to_string(),
-            });
-            return false;
-        };
-        let Some(rec) = self.peers.get_mut(peer) else {
-            return false;
-        };
-        match hello.check_freshness(self.wall_ms, GreatestSeen(rec.greatest_seen)) {
-            Ok(seen) => {
-                rec.greatest_seen = seen.0;
-                rec.name = hello.name;
-                rec.platform = hello.platform;
-                rec.caps_out = hello.caps_out;
-                rec.caps_in = hello.caps_in;
-                let (key, value) = Self::peer_blob(rec);
-                out.push(Action::Persist {
-                    key,
-                    value,
-                    sensitivity: Sensitivity::Secret,
-                });
-                true
-            }
-            Err(e) => {
-                out.ui(UiEvent::Error {
-                    code: ErrorCode::NotAllowed,
-                    detail: e.to_string(),
-                });
-                false
-            }
-        }
+        false /* ~ changed by cargo-mutants ~ */
     }
 
     fn finish_session(
         &mut self,
         now_ms: u64,
         link: LinkId,
         hs: Handshake,
         attrs: LinkAttrs,

---- a_file_is_offered_accepted_and_finished stdout ----

thread 'a_file_is_offered_accepted_and_finished' (261504) panicked at crates/acrylius-core/tests/loopback.rs:1148:5:
the receiving host is asked before anything is listened for

---- a_device_with_nowhere_to_put_a_file_refuses_at_once stdout ----

thread 'a_device_with_nowhere_to_put_a_file_refuses_at_once' (261502) panicked at crates/acrylius-core/tests/loopback.rs:1449:5:
the computer is told now, not in an hour

---- a_better_transport_is_taken_even_while_a_worse_one_is_working stdout ----

thread 'a_better_transport_is_taken_even_while_a_worse_one_is_working' (261499) panicked at crates/acrylius-core/tests/loopback.rs:520:5:
assertion `left == right` failed
  left: Unreachable
 right: Reachable

failures:
    a_better_transport_is_taken_even_while_a_worse_one_is_working
    a_body_too_large_for_the_link_is_refused_not_sent
    a_device_already_reached_is_not_dialled_again
    a_device_with_nowhere_to_put_a_file_refuses_at_once
    a_dial_that_fails_falls_through_to_the_next_route
    a_file_is_offered_accepted_and_finished
    a_file_sends_again_once_wi_fi_takes_over_from_bluetooth
    a_hello_no_newer_than_the_last_one_is_refused
    a_link_that_can_carry_files_is_left_alone
    a_link_that_cannot_carry_files_refuses_instead_of_listening
    a_paired_peer_can_open_a_session_and_ping
    a_session_survives_two_machines_with_different_uptimes

test result: FAILED. 13 passed; 17 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
