*** crates/acrylius-core/src/core.rs:881:9: replace Core::pairing_attempt_failed with ()

*** mutation diff:
--- crates/acrylius-core/src/core.rs
+++ replace Core::pairing_attempt_failed with ()
@@ -873,29 +873,17 @@
         out.push(Action::Close {
             link: a.link,
             reason: LinkDownReason::Closed,
         });
         self.links.remove(&a.link);
     }
 
     fn pairing_attempt_failed(&mut self, link: LinkId, out: &mut Outcome) {
-        let burned = if let Some(w) = &mut self.pairing {
-            w.attempts += 1;
-            w.attempts >= self.config.max_pairing_attempts
-        } else {
-            false
-        };
-        self.fail_link(link, "pairing handshake failed", out);
-        if burned {
-            self.pairing = None;
-            out.ui(UiEvent::PairingFailed {
-                reason: "too many failed attempts; the window is closed".to_string(),
-            });
-        }
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn peer_blob(rec: &PeerRecord) -> (String, Option<Vec<u8>>) {
         (
             format!("peer/{}", rec.device_id),
             Some(minicbor::to_vec(rec).expect("peer record encodes")),
         )
     }

---- a_pairing_window_closes_after_too_many_wrong_codes stdout ----

thread 'a_pairing_window_closes_after_too_many_wrong_codes' (262053) panicked at crates/acrylius-core/tests/loopback.rs:610:5:
the window is still open after 3 wrong codes; B saw [(B, PairingWindowOpen { code: "ABCD1234", expires_in_ms: 120000 })]

failures:
    a_pairing_window_closes_after_too_many_wrong_codes

test result: FAILED. 29 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
