*** crates/acrylius-core/src/core.rs:1246:37: replace match guard &u.peer == peer with true in Core::best_link

*** mutation diff:
--- crates/acrylius-core/src/core.rs
+++ replace match guard &u.peer == peer with true in Core::best_link
@@ -1238,17 +1238,17 @@
     /// daemon, and quietly false anywhere ids are minted another way.
     ///
     /// Preference is ascending transport id: Wi-Fi before Bluetooth, which is
     /// the order the hosts register them in.
     fn best_link(&self, peer: &DeviceId) -> Option<(LinkId, &UpLink)> {
         self.links
             .iter()
             .filter_map(|(id, st)| match st {
-                LinkState::Up(u) if &u.peer == peer => Some((*id, &**u)),
+                LinkState::Up(u) if true /* ~ changed by cargo-mutants ~ */ => Some((*id, &**u)),
                 _ => None,
             })
             .min_by_key(|(_, u)| u.transport)
     }
 
     fn best_link_transport(&self, peer: &DeviceId) -> Option<TransportId> {
         self.best_link(peer).map(|(_, u)| u.transport)
     }

---- a_message_goes_to_the_peer_it_is_addressed_to stdout ----

thread 'a_message_goes_to_the_peer_it_is_addressed_to' (287219) panicked at crates/acrylius-core/tests/loopback.rs:830:5:
the pong did not come from the computer the ping was addressed to

failures:
    a_message_goes_to_the_peer_it_is_addressed_to

test result: FAILED. 30 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
