*** crates/acrylius-core/src/core.rs:1568:9: replace Core::on_link_down with ()

*** mutation diff:
--- crates/acrylius-core/src/core.rs
+++ replace Core::on_link_down with ()
@@ -1560,61 +1560,17 @@
                 p.on_tick(&mut cx);
             }
             self.next_token = cx.next_token;
             self.drain_cx(cx, out);
         }
     }
 
     fn on_link_down(&mut self, now_ms: u64, link: LinkId, out: &mut Outcome) {
-        let Some(LinkState::Up(u)) = self.links.remove(&link) else {
-            return;
-        };
-
-        // Losing a link is not losing a device.
-        //
-        // This used to announce every link's death as the peer's, which is
-        // wrong the moment a peer is reachable two ways — the arrangement a
-        // phone beside a desktop has all the time. Neither consequence is
-        // cosmetic. `PeerUnreachable` is what a host uses to throw away what a
-        // peer told it, and `on_peer_disconnected` is what stops a plugin
-        // broadcasting to it. So switching from Wi-Fi to Bluetooth emptied the
-        // phone's session controls and stopped the desktop announcing its lock
-        // state to a device it was still connected to.
-        //
-        // And nothing put either back, because the repair for both hangs off
-        // the peer becoming reachable again — which never happens to a peer
-        // that never left.
-        if self.best_link(&u.peer).is_some() {
-            // Still here, but possibly not over what it was. Said rather than
-            // left silent, because a host that shows which transport is
-            // carrying would otherwise go on showing the one that just died,
-            // and because this is the moment to ask a peer for anything that
-            // was only ever sent when it changed.
-            let name = self
-                .peers
-                .get(&u.peer)
-                .map(|r| r.name.clone())
-                .unwrap_or_default();
-            out.ui(UiEvent::PeerReachable {
-                peer: u.peer.clone(),
-                name,
-            });
-            return;
-        }
-
-        out.ui(UiEvent::PeerUnreachable {
-            peer: u.peer.clone(),
-        });
-        let mut cx = Cx::new(now_ms, self.next_token, self.serves);
-        for p in &mut self.plugins {
-            p.on_peer_disconnected(&mut cx, &u.peer);
-        }
-        self.next_token = cx.next_token;
-        self.drain_cx(cx, out);
+        () /* ~ changed by cargo-mutants ~ */
     }
 
     fn fail_link(&mut self, link: LinkId, detail: &str, out: &mut Outcome) {
         self.links.remove(&link);
         out.push(Action::Close {
             link,
             reason: LinkDownReason::Protocol(ErrorCode::NotAllowed),
         });

---- an_unpaired_stranger_cannot_open_a_session stdout ----

thread 'an_unpaired_stranger_cannot_open_a_session' (364571) panicked at crates/acrylius-core/tests/loopback.rs:1018:5:
assertion `left == right` failed
  left: Reachable
 right: Unreachable

---- losing_the_last_route_does_report_the_device_as_gone stdout ----

thread 'losing_the_last_route_does_report_the_device_as_gone' (364574) panicked at crates/acrylius-core/tests/loopback.rs:573:5:
the last route died and nobody was told

---- a_worse_transport_takes_over_when_the_better_one_dies stdout ----

thread 'a_worse_transport_takes_over_when_the_better_one_dies' (364567) panicked at crates/acrylius-core/tests/loopback.rs:517:5:
assertion `left == right` failed: and what is left is what carries
  left: Some(UnixLoopback)
 right: Some(BleGatt)

failures:
    a_worse_transport_takes_over_when_the_better_one_dies
    an_unpaired_stranger_cannot_open_a_session
    losing_one_of_two_routes_does_not_report_the_device_as_gone
    losing_the_last_route_does_report_the_device_as_gone

test result: FAILED. 29 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
