*** crates/acrylius-core/src/core.rs:215:37: replace match guard &u.peer == peer with true in Core::peer_state

*** mutation diff:
--- crates/acrylius-core/src/core.rs
+++ replace match guard &u.peer == peer with true in Core::peer_state
@@ -207,17 +207,17 @@
             .as_ref()
             .map(|a| a.sas.as_str())
     }
 
     #[must_use]
     pub fn peer_state(&self, peer: &DeviceId) -> PeerState {
         for st in self.links.values() {
             match st {
-                LinkState::Up(u) if &u.peer == peer => return PeerState::Reachable,
+                LinkState::Up(u) if true /* ~ changed by cargo-mutants ~ */ => return PeerState::Reachable,
                 LinkState::Handshaking(h) if h.expect.as_ref() == Some(peer) => {
                     return PeerState::Connecting;
                 }
                 _ => {}
             }
         }
         PeerState::Unreachable
     }

---- a_message_goes_to_the_peer_it_is_addressed_to stdout ----

thread 'a_message_goes_to_the_peer_it_is_addressed_to' (279800) panicked at crates/acrylius-core/tests/loopback.rs:830:5:
the pong did not come from the computer the ping was addressed to

failures:
    a_message_goes_to_the_peer_it_is_addressed_to

test result: FAILED. 30 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
