*** crates/acrylius-core/src/core.rs:215:37: replace match guard &u.peer == peer with false in Core::peer_state

*** mutation diff:
--- crates/acrylius-core/src/core.rs
+++ replace match guard &u.peer == peer with false in Core::peer_state
@@ -207,17 +207,17 @@
             .as_ref()
             .map(|a| a.sas.as_str())
     }
 
     #[must_use]
     pub fn peer_state(&self, peer: &DeviceId) -> PeerState {
         for st in self.links.values() {
             match st {
-                LinkState::Up(u) if &u.peer == peer => return PeerState::Reachable,
+                LinkState::Up(u) if false /* ~ changed by cargo-mutants ~ */ => return PeerState::Reachable,
                 LinkState::Handshaking(h) if h.expect.as_ref() == Some(peer) => {
                     return PeerState::Connecting;
                 }
                 _ => {}
             }
         }
         PeerState::Unreachable
     }

---- a_device_already_reached_is_not_dialled_again stdout ----

thread 'a_device_already_reached_is_not_dialled_again' (280410) panicked at crates/acrylius-core/tests/loopback.rs:707:5:
assertion `left == right` failed
  left: Unreachable
 right: Reachable

---- a_file_sends_again_once_wi_fi_takes_over_from_bluetooth stdout ----

thread 'a_file_sends_again_once_wi_fi_takes_over_from_bluetooth' (280414) panicked at crates/acrylius-core/tests/loopback.rs:1403:5:
assertion `left == right` failed
  left: Unreachable
 right: Reachable

---- a_dial_that_fails_falls_through_to_the_next_route stdout ----

thread 'a_dial_that_fails_falls_through_to_the_next_route' (280412) panicked at crates/acrylius-core/tests/loopback.rs:737:5:
assertion `left == right` failed
  left: Unreachable
 right: Reachable

failures:
    a_better_transport_is_taken_even_while_a_worse_one_is_working
    a_device_already_reached_is_not_dialled_again
    a_dial_that_fails_falls_through_to_the_next_route
    a_file_sends_again_once_wi_fi_takes_over_from_bluetooth
    a_hello_no_newer_than_the_last_one_is_refused
    a_message_goes_to_the_peer_it_is_addressed_to
    a_paired_peer_can_open_a_session_and_ping
    a_session_survives_two_machines_with_different_uptimes
    a_worse_transport_takes_over_when_the_better_one_dies
    an_address_seen_before_pairing_is_not_lost
    pairing_records_the_address_it_proved
    seeing_a_paired_device_is_enough_to_reach_it

test result: FAILED. 19 passed; 12 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
