*** crates/acrylius-core/src/core.rs:883:24: replace >= with < in Core::pairing_attempt_failed

*** mutation diff:
--- crates/acrylius-core/src/core.rs
+++ replace >= with < in Core::pairing_attempt_failed
@@ -875,17 +875,17 @@
             reason: LinkDownReason::Closed,
         });
         self.links.remove(&a.link);
     }
 
     fn pairing_attempt_failed(&mut self, link: LinkId, out: &mut Outcome) {
         let burned = if let Some(w) = &mut self.pairing {
             w.attempts += 1;
-            w.attempts >= self.config.max_pairing_attempts
+            w.attempts < /* ~ changed by cargo-mutants ~ */ self.config.max_pairing_attempts
         } else {
             false
         };
         self.fail_link(link, "pairing handshake failed", out);
         if burned {
             self.pairing = None;
             out.ui(UiEvent::PairingFailed {
                 reason: "too many failed attempts; the window is closed".to_string(),

---- a_pairing_window_closes_after_too_many_wrong_codes stdout ----

thread 'a_pairing_window_closes_after_too_many_wrong_codes' (286045) panicked at crates/acrylius-core/tests/loopback.rs:667:9:
the window closed after 1 of 3 attempts

failures:
    a_pairing_window_closes_after_too_many_wrong_codes

test result: FAILED. 30 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
